# -*- coding: utf8 -*-
"""
    pyqqwry.marco
    ~~~~~~~~~~~~~

    Macro.
"""


class Flag(object):

    ONE = 1
    TWO = 2


class Province(object):

    china = (
        ("中国", "北京市"),
        ("中国", "上海市"),
        ("中国", "香港"),
        ("中国", "台湾省"),
        ("中国", "重庆市"),
        ("中国", "澳门"),
        ("中国", "天津市"),
        ("中国", "江苏省"),
        ("中国", "浙江省"),
        ("中国", "四川省"),
        ("中国", "江西省"),
        ("中国", "福建省"),
        ("中国", "青海省"),
        ("中国", "吉林省"),
        ("中国", "贵州省"),
        ("中国", "陕西省"),
        ("中国", "山西省"),
        ("中国", "河北省"),
        ("中国", "湖北省"),
        ("中国", "辽宁省"),
        ("中国", "湖南省"),
        ("中国", "山东省"),
        ("中国", "云南省"),
        ("中国", "河南省"),
        ("中国", "广东省"),
        ("中国", "安徽省"),
        ("中国", "甘肃省"),
        ("中国", "海南省"),
        ("中国", "黑龙江省"),
        ("中国", "内蒙古"),
        ("中国", "新疆"),
        ("中国", "广西"),
        ("中国", "宁夏"),
        ("中国", "西藏")
    )
